[
    {
        "title": "Progress made on biodiversity, but swifter action needed",
        "summary": "A new report on biodiversity finds that the EU is on track to achieve 16 out of 45 targets, even if it must act faster.",
        "date": "12 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/progress-made-biodiversity-swifter-action-needed-2026-02-12_en"
    },
    {
        "title": "New global science highlights business risks from nature loss",
        "summary": "The assessment comes as the EU is stepping up its push for greater investment and private finance for nature.",
        "date": "10 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/new-global-science-highlights-business-risks-nature-loss-2026-02-10_en"
    },
    {
        "title": "The ECESP's new leadership groups have been set up!",
        "summary": "Click if you are interested in joining one of the European Circular Economy Stakeholder Platform (ECESP) Coordination Group's new leadership groups.",
        "date": "10 Feb 2026",
        "source": "European Commission",
        "link": "https://circulareconomy.europa.eu/platform/en/news-and-events/all-news/ecesps-new-leadership-groups-have-been-set"
    },
    {
        "title": "The 2026 ECESP Annual Conference is nearly upon us",
        "summary": "This year's  European Circular Economy Stakeholder Platform event will take place on 22-23 April in Brussels and will focus on the upcoming Circular Economy Act.",
        "date": "10 Feb 2026",
        "source": "European Commission",
        "link": "https://circulareconomy.europa.eu/platform/en/ecesp-annual-conference-2026#msdynmkt_trackingcontext=c7b1a3b7-3eba-46c1-90e6-fa59ef0b0200"
    },
    {
        "title": "New EU rules to stop destruction of unsold clothes and shoes",
        "summary": "The measures under the Ecodesign for Sustainable Products Regulation will allow businesses to benefit from a more circular economy.",
        "date": "09 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/new-eu-rules-stop-destruction-unsold-clothes-and-shoes-2026-02-09_en"
    },
    {
        "title": "Fresh measures to reduce farmers' dependency on imported fertilisers",
        "summary": "The rules take the form of an amendment to the Nitrates Directive.",
        "date": "09 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/fresh-measures-reduce-farmers-dependency-imported-fertilisers-2026-02-09_en"
    },
    {
        "title": "A fresh coat: EU Ecolabel levels up for Paints & Varnishes",
        "summary": "The EU Ecolabel criteria for paints and varnishes got a fresh coating! Read more about the revised requirements.",
        "date": "05 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/fresh-coat-eu-ecolabel-levels-paints-varnishes-2026-02-05_en"
    },
    {
        "title": "Shipbreaking yards are under-explored hotspots for pollution, finds Turkish study",
        "summary": "A new study has found significant concentrations of Persistent Organic Pollutants (POPs) in sediments off the coast of Turkey. Linked to shipbreaking, these pollutants highlight a need for better management to reduce risks to health and environment.",
        "date": "04 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/shipbreaking-yards-are-under-explored-hotspots-pollution-finds-turkish-study-2026-02-04_en"
    },
    {
        "title": "EU forest management still focuses on most profitable services",
        "summary": "Despite both social opinion and EU policies advocating forest management for multiple ecosystem services, income from sources other than wood production remains limited. This imbalance may continue without targeted interventions.",
        "date": "04 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-forest-management-still-focuses-most-profitable-services-2026-02-04_en"
    },
    {
        "title": "Better engagement in conservation policymaking: Considering ethical values could foster connection across diverse stakeholders, finds pollinator study",
        "summary": "Conservation policy often focuses on nature’s right to exist and benefits to human society. A study of influential stakeholders in pollinator policy now highlights other motivations, including moral concerns and responsibility to future generations.",
        "date": "04 Feb 2026",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/better-engagement-conservation-policymaking-considering-ethical-values-could-foster-connection-2026-02-04_en"
    },
    {
        "title": "Monitoring report on progress towards the SDGs in an EU context — 2024",
        "summary": "Eurostat has published the ‘Sustainable development in the European Union — 2024 monitoring report on progress towards the SDGs in an EU context'.",
        "date": "18 Jun 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/monitoring-report-progress-towards-sdgs-eu-context-2024-2024-06-18_en"
    },
    {
        "title": "Bringing sustainable tourism into the spotlight: the EU Ecolabel for tourist accommodation",
        "summary": "Trustworthy, inspiring, sustainable, creating change: these are the words the audience associated with the EU Ecolabel in the latest webinar, ‘Bring tourist accommodation into the green spotlight with the EU Ecolabel’.",
        "date": "12 Jun 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/bringing-sustainable-tourism-spotlight-eu-ecolabel-tourist-accommodation-2024-06-12_en"
    },
    {
        "title": "Europeans continue to feel directly affected by environmental issues and policy",
        "summary": "A new Eurobarometer survey found that more than three-quarters of citizens believe the environment has a direct impact on their daily life.",
        "date": "29 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/europeans-continue-feel-directly-affected-environmental-issues-and-policy-2024-05-29_en"
    },
    {
        "title": "Europe’s bathing waters remain safe",
        "summary": "The majority of bathing water sites in 2023 met the EU's most stringent quality standards, according to the latest annual report.",
        "date": "28 May 2024",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_2901"
    },
    {
        "title": "EU Ecolabel Webinar: Opportunities for businesses in tourist accommodation",
        "summary": "Join the webinar ‘Bring tourist accommodation into the green spotlight with the EU Ecolabel’ on 11 June 2024 to learn all you need to know about the EU Ecolabel, how it works, its future perspectives and discover the opportunities it offers to tourist accommodations.",
        "date": "21 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-webinar-opportunities-businesses-tourist-accommodation-2024-05-21_en"
    },
    {
        "title": "EU continues its engagement in global water cooperation",
        "summary": "From 18-25 May, EU representatives will be attending the 10th edition of the World Water Forum in Bali, Indonesia.",
        "date": "17 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-continues-its-engagement-global-water-cooperation-2024-05-17_en"
    },
    {
        "title": "How the EU Ecolabel helps reduce water waste and pollution",
        "summary": "It’s time to be water wise! The EU's new #WaterWiseEU campaign aims to raise awareness about water related issues, showcase solutions and inspire change. Learn how EU Ecolabel products are part of the solution!",
        "date": "08 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/how-eu-ecolabel-helps-reduce-water-waste-and-pollution-2024-05-08_en"
    },
    {
        "title": "How the EU Ecolabel helps us all make informed choices",
        "summary": "Amidst a sea of green claims and labels, discover how the EU Ecolabel guides people to separate genuine sustainability efforts from marketing hype! Join the movement as the EU Ecolabel Showroom on Wheels tours Europe, empowering consumers to make informed choices.",
        "date": "23 Apr 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/how-eu-ecolabel-helps-us-all-make-informed-choices-2024-04-23_en"
    },
    {
        "title": "EU Ecolabel Showroom on Wheels gears up for Olympic-inspired adventure!",
        "summary": "As Olympic fever rises, the EU Ecolabel's sporty Showroom on Wheels takes to the road to champion eco-friendly products and raise awareness across EU Member States.",
        "date": "16 Apr 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-showroom-wheels-gears-olympic-inspired-adventure-2024-04-16_en"
    },
    {
        "title": "EU Ecolabel - March 2024 Facts and Figures",
        "summary": "Enthusiasm for the EU Ecolabel is reaching new heights, with growth across the vast majority of the 25 product groups in the past six months. Good news for consumers, businesses, and retailers – and for the planet!",
        "date": "09 Apr 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-march-2024-facts-and-figures-2024-04-09_en"
    }
]