[
    {
        "title": "Webinar: Caring for you, caring for the environment: the EU Ecolabel for absorbent hygiene products",
        "summary": "Discover how the EU Ecolabel for absorbent hygiene products boosts competitiveness, ensures environmental excellence, and aligns with EU legislation. Join the European Commission’s webinar on 9 April 2025 to explore business benefits and hear from industry leaders. Register now!",
        "date": "13 Mar 2025",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/webinar-caring-you-caring-environment-eu-ecolabel-absorbent-hygiene-products-2025-03-13_en"
    },
    {
        "title": "The EU Ecolabel for cosmetic products webinar",
        "summary": "Trustworthy, informative, enlightening and insightful: these were some of the key takeaways from the webinar \"When Beauty Meets Green\", which aimed to explain the opportunities offered by the EU Ecolabel for cosmetic products.",
        "date": "16 Dec 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-cosmetic-products-webinar-2024-12-16_en"
    },
    {
        "title": "EU Ecolabel Cosmetics Webinar",
        "summary": "Join the webinar ‘ When beauty meets green: the EU Ecolabel for cosmetic products ’ on 11 December 2024 to learn all you need to know about the EU Ecolabel, its future perspectives, and the opportunities it offers cosmetics producers to showcase the environmental credentials of their products.",
        "date": "12 Nov 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-cosmetics-webinar-2024-11-12_en"
    },
    {
        "title": "EU invests over €380 million in 133 new LIFE projects to support the green transition all around Europe",
        "summary": "The Commission has granted today more than €380 million to 133 new projects across Europe under the LIFE Programme for environment and climate action.",
        "date": "21 Oct 2024",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_5381"
    },
    {
        "title": "Nature Restoration Law enters into force",
        "summary": "The regulation sets binding targets to restore degraded ecosystems, particularly those with the most potential to capture and store carbon.",
        "date": "15 Aug 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/nature-restoration-law-enters-force-2024-08-15_en"
    },
    {
        "title": "New legislation gives EU Ecolabel big thumbs up",
        "summary": "The EU Ecolabel is preparing for a major boost thanks to the new and upcoming legislation.  Discover how our labelling scheme supports the EU's green transition.",
        "date": "24 Jun 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/new-legislation-gives-eu-ecolabel-big-thumbs-2024-06-24_en"
    },
    {
        "title": "Monitoring report on progress towards the SDGs in an EU context — 2024",
        "summary": "Eurostat has published the ‘Sustainable development in the European Union — 2024 monitoring report on progress towards the SDGs in an EU context'.",
        "date": "18 Jun 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/monitoring-report-progress-towards-sdgs-eu-context-2024-2024-06-18_en"
    },
    {
        "title": "Bringing sustainable tourism into the spotlight: the EU Ecolabel for tourist accommodation",
        "summary": "Trustworthy, inspiring, sustainable, creating change: these are the words the audience associated with the EU Ecolabel in the latest webinar, ‘Bring tourist accommodation into the green spotlight with the EU Ecolabel’.",
        "date": "12 Jun 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/bringing-sustainable-tourism-spotlight-eu-ecolabel-tourist-accommodation-2024-06-12_en"
    },
    {
        "title": "Europeans continue to feel directly affected by environmental issues and policy",
        "summary": "A new Eurobarometer survey found that more than three-quarters of citizens believe the environment has a direct impact on their daily life.",
        "date": "29 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/europeans-continue-feel-directly-affected-environmental-issues-and-policy-2024-05-29_en"
    },
    {
        "title": "Europe’s bathing waters remain safe",
        "summary": "The majority of bathing water sites in 2023 met the EU's most stringent quality standards, according to the latest annual report.",
        "date": "28 May 2024",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_2901"
    },
    {
        "title": "EU Ecolabel Webinar: Opportunities for businesses in tourist accommodation",
        "summary": "Join the webinar ‘Bring tourist accommodation into the green spotlight with the EU Ecolabel’ on 11 June 2024 to learn all you need to know about the EU Ecolabel, how it works, its future perspectives and discover the opportunities it offers to tourist accommodations.",
        "date": "21 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-webinar-opportunities-businesses-tourist-accommodation-2024-05-21_en"
    },
    {
        "title": "EU continues its engagement in global water cooperation",
        "summary": "From 18-25 May, EU representatives will be attending the 10th edition of the World Water Forum in Bali, Indonesia.",
        "date": "17 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-continues-its-engagement-global-water-cooperation-2024-05-17_en"
    },
    {
        "title": "How the EU Ecolabel helps reduce water waste and pollution",
        "summary": "It’s time to be water wise! The EU's new #WaterWiseEU campaign aims to raise awareness about water related issues, showcase solutions and inspire change. Learn how EU Ecolabel products are part of the solution!",
        "date": "08 May 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/how-eu-ecolabel-helps-reduce-water-waste-and-pollution-2024-05-08_en"
    },
    {
        "title": "EU Ecolabel Showroom on Wheels gears up for Olympic-inspired adventure!",
        "summary": "As Olympic fever rises, the EU Ecolabel's sporty Showroom on Wheels takes to the road to champion eco-friendly products and raise awareness across EU Member States.",
        "date": "16 Apr 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-showroom-wheels-gears-olympic-inspired-adventure-2024-04-16_en"
    },
    {
        "title": "EU Ecolabel - March 2024 Facts and Figures",
        "summary": "Enthusiasm for the EU Ecolabel is reaching new heights, with growth across the vast majority of the 25 product groups in the past six months. Good news for consumers, businesses, and retailers – and for the planet!",
        "date": "09 Apr 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-ecolabel-march-2024-facts-and-figures-2024-04-09_en"
    },
    {
        "title": "World Water Day: Joint Statement by Borrell and Sinkevičius",
        "summary": "The health and prosperity of people and the planet rely on the stability of the global water cycle.",
        "date": "22 Mar 2024",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/statement_24_1577"
    },
    {
        "title": "EU 2030 climate and environmental targets within reach",
        "summary": "The Commission's mid-term review of the 8th Environment Action Programme, released Wednesday, confirms that the goals are achievable.",
        "date": "13 Mar 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/eu-2030-climate-and-environmental-targets-within-reach-2024-03-13_en"
    },
    {
        "title": "Revision of EU Ecolabel criteria for textile  products",
        "summary": "The criteria for the Textile product group is under revision. The first multistakeholder working group to revise the criteria is scheduled between the 18th and 19th of March.",
        "date": "07 Mar 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/revision-eu-ecolabel-criteria-textile-products-2024-03-07_en"
    },
    {
        "title": "Revision of EU Ecolabel criteria for cleaning products",
        "summary": "The criteria for the Detergents product group is under revision. The first multistakeholder working group to revise the criteria is scheduled between the 12 th and 13 th of March.",
        "date": "04 Mar 2024",
        "source": "European Commission",
        "link": "https://environment.ec.europa.eu/news/revision-eu-ecolabel-criteria-cleaning-products-2024-03-04_en"
    },
    {
        "title": "Drinking water to become safer thanks to new EU-wide hygiene standards",
        "summary": "The Commission has adopted new minimum hygiene standards for products that will make water safer to drink.",
        "date": "23 Jan 2024",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_24_350"
    },
    {
        "title": "Commission welcomes provisional agreement for more sustainable, repairable and circular products",
        "summary": "The Commission welcomes the provisional agreement reached last night between the European Parliament and the Council on the Ecodesign for Sustainable Products Regulation.",
        "date": "05 Dec 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_6257"
    },
    {
        "title": "Commission welcomes political agreement on protecting the environment through criminal law",
        "summary": "The European Commission welcomes the provisional agreement reached today between the European Parliament and the Council on the protection of the environment through criminal law.",
        "date": "17 Nov 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_5817"
    },
    {
        "title": "Commission welcomes political agreement on stronger control of exports of waste",
        "summary": "The Commission welcomes the political agreement reached last night between the European Parliament and the Council on waste shipments.",
        "date": "17 Nov 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_5818"
    },
    {
        "title": "New measures to reduce microplastic pollution from plastic pellets",
        "summary": "Today, the Commission is proposing measures to prevent microplastic pollution from the unintentional release of plastic pellets.",
        "date": "16 Oct 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_4984"
    },
    {
        "title": "Question and Answers: Reducing microplastic pollution from plastic pellets",
        "summary": "Find out more about the new proposal for a Regulation on plastic pellets.",
        "date": "16 Oct 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/qanda_23_4985"
    },
    {
        "title": "Zero Pollution: new measures to reduce microplastics",
        "summary": "The Commission has adopted measures restricting the use of microplastics under the EU chemical legislation REACH. These measures support the Zero Pollution Action Plan 2030 target to reduce microplastics released into the environment by 30%.",
        "date": "28 Sep 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_4581"
    },
    {
        "title": "Protecting environment and health: Commission adopts measures to restrict intentionally added microplastics",
        "summary": "The new rules, under chemicals legislation REACH, will prevent the release to the environment of about half a million tonnes of microplastics.",
        "date": "25 Sep 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_4581"
    },
    {
        "title": "Joint Press Release following the Fourth EU-China High Level Environment and Climate Dialogue",
        "summary": "European Commission Executive Vice President Frans Timmermans and Vice Premier of the People's Republic of China Ding Xuexiang held the fourth EU-China High Level Dialogue on Environment and Climate (HECD) in Beijing on 4 July 2023.",
        "date": "24 Jul 2023",
        "source": "European Commission",
        "link": "https://climate.ec.europa.eu/news-your-voice/news/joint-press-release-following-fourth-eu-china-high-level-environment-and-climate-dialogue-2023-07-24_en"
    },
    {
        "title": "Circular economy: improving design and end-of-life management of cars for more resource-efficient automotive sector",
        "summary": "The Commission is proposing measures to enhance the circularity of the automotive sector, covering the design, production and end-of-life treatment of vehicles.",
        "date": "13 Jul 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/IP_23_3819"
    },
    {
        "title": "Circular economy for textiles: taking responsibility to reduce, reuse and recycle textile waste and boosting markets for used textiles",
        "summary": "Today, the Commission is proposing rules to make producers responsible for the full lifecycle of textile products and to support the sustainable management of textile waste across the EU.",
        "date": "05 Jul 2023",
        "source": "European Commission",
        "link": "https://ec.europa.eu/commission/presscorner/detail/en/ip_23_3635"
    },
    {
        "title": "Legislation",
        "summary": "Acts of Parliament are available without charge, and updated monthly, at the Singapore Statutes Online Website.",
        "date": "03 Jan 2025",
        "source": "The National Environment Agency",
        "link": "https://www.nea.gov.sg/corporate-functions/resources/legislation-international-law/legislation"
    },
    {
        "title": "Sustainability reporting will pay off for S’pore companies in the long run: Experts",
        "summary": "SINGAPORE – Ramped-up rules on sustainability reporting might be burdensome for companies large and small, but they will pay off in the long...",
        "date": "03 Jan 2025",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/business/companies-markets/sustainability-reporting-will-pay-off-for-spore-companies-in-the-long-run-experts"
    },
    {
        "title": "Singapore moves forward with ISSB standards, despite scope 3 delay",
        "summary": "Singapore Exchange Regulation (SGX RegCo) is set to apply the latest international sustainability standards to listed companies.",
        "date": "01 Oct 2024",
        "source": "Green Central Banking",
        "link": "https://greencentralbanking.com/2024/10/01/singapore-moves-forward-with-issb-standards-despite-scope-3-delay/"
    },
    {
        "title": "New Queen Bee Enabled Sustainability Transition (QUEST) programme launched to support SingPost’s suppliers with sustainability efforts",
        "summary": "Friday, 18 October 2024 [Singapore] – The Singapore Business Federation (SBF), in partnership with Singapore Post (SingPost), Ernst & Young...",
        "date": "21 Oct 2024",
        "source": "Singapore Post",
        "link": "https://www.singpost.com/about-us/news-releases/new-queen-bee-enabled-sustainability-transition-quest-programme-launched"
    },
    {
        "title": "Singapore Exchange Softens Requirement for Scope 3 Reporting for Smaller Companies",
        "summary": "SGX RegCo announced updates to its sustainability reporting rules for listed companies, including pushing back mandatory value chain, or Scope 3, emissions...",
        "date": "24 Sep 2024",
        "source": "ESG Today",
        "link": "https://www.esgtoday.com/singapore-exchange-softens-requirement-for-scope-3-reporting-for-smaller-companies/"
    },
    {
        "title": "Singapore's pavilion at IMEX America sets new sustainability standards",
        "summary": "The pavilion sets a new benchmark with initiatives that reduces booth-related emissions by 45% and aims for carbon-neutral participation at key international...",
        "date": "11 Oct 2024",
        "source": "Meetings & Conventions Asia",
        "link": "https://www.meetings-conventions-asia.com/News/Conferences-and-Exhibitions/Singapores-pavilion-at-IMEX-America-sets-new-sustainability-standards"
    },
    {
        "title": "SGX RegCo sets new standards in sustainability reporting starting FY2025",
        "summary": "Starting FY2025, the Singapore Exchange Regulation (SGX RegCo) will start incorporating the IFRS Sustainability Disclosure Standards into its...",
        "date": "23 Sep 2024",
        "source": "Singapore Business Review",
        "link": "https://sbr.com.sg/markets-investing/news/sgx-regco-sets-new-standards-in-sustainability-reporting-starting-fy2025"
    },
    {
        "title": "Singapore’s ISCA Unveils 2024 Sustainability Reporting Guide for Compliance with ISSB Standards",
        "summary": "The Institute of Singapore Chartered Accountants (ISCA) has introduced a comprehensive guide to support companies in their sustainability reporting efforts.",
        "date": "10 Oct 2024",
        "source": "Seneca ESG",
        "link": "https://senecaesg.com/insights/singapores-isca-unveils-2024-sustainability-reporting-guide-for-compliance-with-issb-standards/"
    },
    {
        "title": "Singapore: ESG developments",
        "summary": "ESG is increasingly of prioritised concern to companies and organisations due to a growing number of legislations and regulations as well as...",
        "date": "25 Apr 2024",
        "source": "Global Compliance News",
        "link": "https://www.globalcompliancenews.com/2024/04/25/https-insightplus-bakermckenzie-com-bm-dispute-resolution-singapore-esg-developments_04172024/"
    },
    {
        "title": "CNA Explains: More companies are putting out sustainability reports – why, and how to read them?",
        "summary": "SINGAPORE: On top of voluminous annual reports and financial statements, more companies are presenting their actions in the environmental,...",
        "date": "23 Jul 2024",
        "source": "CNA",
        "link": "https://www.channelnewsasia.com/business/sustainability-reports-acronyms-cna-explains-4490596"
    },
    {
        "title": "Sustainability reporting can help S’pore SMEs attract clients, consumers, financing: Experts",
        "summary": "SINGAPORE - Recent developments such as new international standards on climate-related disclosures have helped to clear the air for firms...",
        "date": "13 Nov 2024",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/business/companies-markets/sustainability-reporting-can-help-s-pore-smes-attract-clients-consumers-financing-experts"
    },
    {
        "title": "Food Waste Management",
        "summary": "Food waste accounted for about 11 per cent of the total waste generated in Singapore in 2023. The total amount of food waste generated in...",
        "date": "30 Jul 2024",
        "source": "The National Environment Agency",
        "link": "https://www.nea.gov.sg/our-services/waste-management/3r-programmes-and-resources/food-waste-management"
    },
    {
        "title": "Enterprise Singapore and EDB to launch sustainability reporting grant in November",
        "summary": "The SRG will assist companies in producing their first sustainability reports aligned with the ISSB standards, as required by SGX RegCo and/or Acra.",
        "date": "21 Oct 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/companies-markets/enterprise-singapore-and-edb-launch-sustainability-reporting-grant-november"
    },
    {
        "title": "New law to bolster S’pore’s food safety, security passed, with powers to increase food stockpiles",
        "summary": "SINGAPORE - A new law that aims to bolster Singapore's food safety regulations and safeguard food security will, among other things,...",
        "date": "09 Jan 2025",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/singapore/politics/new-law-to-bolster-spores-food-safety-security-passed-with-powers-to-increase-food-stockpiles"
    },
    {
        "title": "Isca launches new sustainability guide for companies",
        "summary": "The Institute of Singapore Chartered Accountants (Isca) has launched a guide to support entities in sustainability reporting.",
        "date": "14 Oct 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/esg/isca-launches-new-sustainability-guide-companies"
    },
    {
        "title": "Companies to report greenhouse gas emissions starting FY2025: SGX",
        "summary": "The move reflects a growing emphasis on transparency and accountability in environmental impact. Read more at straitstimes.com.",
        "date": "23 Sep 2024",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/business/companies-to-report-greenhouse-gas-emissions-starting-fy2025-sgx"
    },
    {
        "title": "SMEs should prepare early for a future when sustainable reporting is mandatory: Enterprise SG",
        "summary": "SMALL and medium-sized enterprises (SMEs) in Singapore should start taking steps in disclosing their sustainability metrics,...",
        "date": "02 Jul 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/esg/smes-should-prepare-early-future-when-sustainable-reporting-mandatory-enterprise-sg"
    },
    {
        "title": "Soilbuild strives towards new sustainability standards with Tampines Connection",
        "summary": "the eco-friendly development will aim to achieve the highest BCA sustainability rating — the Green Mark Platinum Super Low Energy (SLE)...",
        "date": "18 Oct 2024",
        "source": "EdgeProp.sg",
        "link": "https://www.edgeprop.sg/property-news/soilbuild-strives-towards-new-sustainability-standards-tampines-connection"
    },
    {
        "title": "Singapore to Introduce Mandatory Climate Reporting Beginning 2025",
        "summary": "Singapore will implement mandatory climate-related reporting requirements for listed and large non-listed companies.",
        "date": "28 Feb 2024",
        "source": "ESG Today",
        "link": "https://www.esgtoday.com/singapore-to-introduce-mandatory-climate-reporting-beginning-2025/"
    },
    {
        "title": "Singapore moves forward with mandatory climate reporting – implications for U.S.-based multinationals",
        "summary": "Singapore will introduce mandatory climate-related disclosures in a phased approach, in line with the final accepted recommendations.",
        "date": "15 Apr 2024",
        "source": "Ropes & Gray",
        "link": "https://www.ropesgray.com/en/insights/viewpoints/102j5cd/singapore-moves-forward-with-mandatory-climate-reporting-implications-for-u-s"
    },
    {
        "title": "Singapore Budget 2024: Key ESG Takeaways & Grants to support Sustainability Reporting",
        "summary": "Singapore's Budget 2024 signals a shift for businesses to kickstart sustainability reporting. Read on for key ESG takeaways,...",
        "date": "03 Apr 2024",
        "source": "ESGpedia",
        "link": "https://esgpedia.io/singapore-budget-2024-sustainability-reporting-grants/"
    },
    {
        "title": "A regional comparison of ESG regulations: Singapore",
        "summary": "Environmental, social and governance (ESG) standards are rapidly gaining prominence regionally and internationally, as regulators equip...",
        "date": "10 Aug 2023",
        "source": "Clyde & Co",
        "link": "https://www.clydeco.com/en/insights/2023/08/a-regional-comparison-of-esg-regulations-singapore"
    },
    {
        "title": "Keeping up to speed with Singapore ESG regulations",
        "summary": "Singapore's regulations on environmental, social and corporate governance (ESG) are rapidly evolving and companies need to keep up to speed.",
        "date": "11 Aug 2023",
        "source": "Law.asia",
        "link": "https://law.asia/singapore-evolving-esg-regulations/"
    },
    {
        "title": "More Singapore businesses will have to report sustainability information, starting with listed firms in 2025",
        "summary": "All listed companies in Singapore will be required to make climate-related disclosures starting from the financial year (FY) of 2025.",
        "date": "28 Feb 2024",
        "source": "CNA",
        "link": "https://www.channelnewsasia.com/singapore/singapore-mandatory-climate-disclosures-listed-companies-2025-4155586"
    },
    {
        "title": "DPM Heng Swee Keat at the Launch of the SGX Sustainability Reporting Review",
        "summary": "Speech by Deputy Prime Minister and Coordinating Minister for Economic Policies Heng Swee Keat at the Launch of the SGX Sustainability Reporting Review on 23...",
        "date": "23 Nov 2023",
        "source": "Prime Minister's Office Singapore",
        "link": "https://www.pmo.gov.sg/Newsroom/DPM-Heng-Swee-Keat-at-the-Launch-of-the-SGX-Sustainability-Reporting-Review"
    },
    {
        "title": "Singapore’s Carbon Regulations: Paving the Way for the Green Plan 2030",
        "summary": "Other Author Maria Chang, Senior Associate of PK Wong & Nair Recognising the threat of climate change and the importance of sustainable.",
        "date": "06 Feb 2024",
        "source": "Mayer Brown",
        "link": "https://www.mayerbrown.com/en/insights/publications/2024/02/singapores-carbon-regulations-paving-the-way-for-the-green-plan-2030"
    },
    {
        "title": "Raising standards for sustainability reporting in Singapore",
        "summary": "Listed companies in Singapore achieved a collective “A” grade for sustainability reporting in the latest Sustainability Reporting Review by...",
        "date": "07 Dec 2023",
        "source": "NUS - National University of Singapore",
        "link": "https://news.nus.edu.sg/raising-standards-for-sustainability-reporting-in-singapore/"
    },
    {
        "title": "The green balancing act: How Singapore SMEs can navigate sustainability and costs",
        "summary": "Recent surveys found that some of the top challenges that SMEs face in going green include lack of knowledge and lack of manpower.",
        "date": "12 Mar 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/esg/the-green-balancing-act-how-singapore-smes-can-navigate-sustainability-and-costs"
    },
    {
        "title": "A new dawn for ESG regulation in Singapore?",
        "summary": "September 2023 | SPOTLIGHT | RISK MANAGEMENT. Financier Worldwide Magazine. September 2023 Issue. Singapore's regulators are taking important steps toward...",
        "date": "15 Aug 2023",
        "source": "Financier Worldwide",
        "link": "https://www.financierworldwide.com/a-new-dawn-for-esg-regulation-in-singapore"
    },
    {
        "title": "Singapore to Provide Funding for Companies to Meet New Climate Reporting Requirements",
        "summary": "The government of Singapore announced the launch of a new Sustainability Reporting Grant, providing companies with support covering up to nearly a third of the...",
        "date": "06 Mar 2024",
        "source": "ESG Today",
        "link": "https://www.esgtoday.com/singapore-to-provide-funding-for-companies-to-meet-new-climate-reporting-requirements/"
    },
    {
        "title": "Unlocking ESG Reporting Requirements in Singapore",
        "summary": "In this latest issue of ASEAN Briefing, we dive into the regulatory requirements of ESG reporting in Singapore before describing what needs to be included in...",
        "date": "04 Mar 2024",
        "source": "ASEAN Briefing",
        "link": "https://www.aseanbriefing.com/news/unlocking-esg-reporting-requirements-in-singapore-latest-issue-of-asean-briefing-magazine/"
    },
    {
        "title": "Climate vouchers, coastal protection law among sustainability measures announced at Budget debate",
        "summary": "SINGAPORE – Sustainability was a key pillar that was mentioned in the 2024 Budget debate for multiple ministries. What are some of the new...",
        "date": "18 Mar 2024",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/singapore/politics/at-a-glance-sustainability-measures-announced-at-the-2024-budget-debate"
    },
    {
        "title": "Large non-listed companies required to make climate disclosures from FY2027",
        "summary": "Large non-listed companies will be required to make climate disclosures from the 2027 fiscal year, in a move by the government aimed at equipping Singapore...",
        "date": "28 Feb 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/esg/large-non-listed-companies-required-to-make-climate-disclosures-from-fy2027"
    },
    {
        "title": "Consultation Paper on Sustainability Reporting: Enhancing Consistency and Comparability",
        "summary": "SGX RegCo has enhanced its sustainability reporting regime and will start incorporating the latest international standards into its sustainability reporting...",
        "date": "07 Mar 2024",
        "source": "Singapore Exchange (SGX)",
        "link": "https://www.sgx.com/regco/public-consultations/20240307-consultation-paper-sustainability-reporting-enhancing"
    },
    {
        "title": "Singapore among the first in Asia to propose mandatory climate reporting for non-listed companies",
        "summary": "Singapore's listed companies could make mandatory climate-related disclosures from FY2025, followed by large non-listed companies from FY2027.",
        "date": "07 Jul 2023",
        "source": "Eco-Business",
        "link": "https://www.eco-business.com/news/singapore-among-the-first-in-asia-to-propose-mandatory-climate-reporting-for-non-listed-companies/"
    },
    {
        "title": "From Big Four dominance to more oversight of assurance providers – what to look out for as Asia adopts ISSB standards",
        "summary": "Australia, Japan, Hong Kong, Malaysia, New Zealand, Philippines and Singapore are introducing mandatory climate reporting rules,...",
        "date": "26 Mar 2024",
        "source": "Eco-Business",
        "link": "https://www.eco-business.com/news/from-big-four-dominance-to-more-oversight-of-assurance-providers-what-to-look-out-for-as-asia-adopts-issb-standards/"
    },
    {
        "title": "Global Greenwashing Regulations: How the World Is Cracking Down on Misleading Sustainability Claims",
        "summary": "Amid fears of greenwashing claims, sustainable investment assets have dropped as much as 51-percent. This blog outlines how ESG Stewardship...",
        "date": "14 Nov 2023",
        "source": "Sustainalytics",
        "link": "https://www.sustainalytics.com/esg-research/resource/investors-esg-blog/global-greenwashing-regulations--how-the-world-is-cracking-down-on-misleading-sustainability-claims"
    },
    {
        "title": "Enterprise Singapore developing new local, international sustainability standards and accreditation schemes",
        "summary": "Today, EnterpriseSG says it has supported more than 70 companies in adopting sustainability-related standards through the ESP, and has supported...",
        "date": "29 Sep 2023",
        "source": "The Edge Singapore",
        "link": "https://www.theedgesingapore.com/news/sustainability/enterprise-singapore-developing-new-local-international-sustainability-standards"
    },
    {
        "title": "Singapore Proposes Mandatory Climate Reporting for both Public and Private Companies",
        "summary": "Public and large private companies in Singapore will be required to provide climate-related disclosures aligned with the IFRS' newly published ISSB disclosure...",
        "date": "10 Jul 2023",
        "source": "ESG Today",
        "link": "https://www.esgtoday.com/singapore-proposes-mandatory-climate-reporting-for-both-public-and-private-companies/"
    },
    {
        "title": "Navigating the green horizon: The real estate response to ESG in Asia Pacific",
        "summary": "RSM's real estate specialists share their insights on how the global demand for sustainable practices is shaping the sector.",
        "date": "06 Feb 2024",
        "source": "RSM Global",
        "link": "https://www.rsm.global/singapore/insights/navigating-green-horizon-real-estate-response-esg-asia-pacific"
    },
    {
        "title": "Singapore and China join forces with new green finance taskforce",
        "summary": "Sustainable finance garners significant attention from global investors and policymakers. In recent years, Europe has led the way in...",
        "date": "20 Sep 2023",
        "source": "East Asia Forum",
        "link": "https://eastasiaforum.org/2023/09/20/singapore-and-china-join-forces-with-new-green-finance-taskforce/"
    },
    {
        "title": "Singapore to roll out mandatory climate reporting from 2025",
        "summary": "Singapore has announced plans to introduce new reporting requirements which will make climate-related disclosures mandatory for Singapore Exchange (SGX) listed...",
        "date": "07 Mar 2024",
        "source": "Pinsent Masons",
        "link": "https://www.pinsentmasons.com/out-law/news/singapore-to-roll-out-mandatory-climate-reporting-from-2025"
    },
    {
        "title": "Law don who backed setting up of environmental law centre among 33 environmentalists lauded",
        "summary": "SINGAPORE – Multilateral environmental treaties and lawsuits against fossil fuel firms have recently propelled environmental law into the...",
        "date": "29 Jul 2024",
        "source": "The Straits Times",
        "link": "https://www.straitstimes.com/singapore/law-don-who-championed-setup-of-environmental-law-centre-among-33-awardees-of-inaugural-award"
    },
    {
        "title": "News Releases",
        "summary": "JOINT NEWS RELEASE BETWEEN NEA AND PPP, SDO@SCIC AND SSC. Singapore, 7 October 2022 - To equip producers of packaged products as well as...",
        "date": "07 Oct 2022",
        "source": "The National Environment Agency",
        "link": "https://www.nea.gov.sg/media/news/news/index/new-technical-reference-to-guide-companies-on-sustainable-packaging-practices"
    },
    {
        "title": "Singapore listcos must report direct and indirect greenhouse gas emissions from FY2025",
        "summary": "SINGAPORE-LISTED companies must start reporting their Scope 1 and Scope 2 greenhouse gas (GHG) emissions from the 2025 financial year,...",
        "date": "23 Sep 2024",
        "source": "The Business Times",
        "link": "https://www.businesstimes.com.sg/esg/sustainable-finance/singapore-listcos-must-report-direct-and-indirect-greenhouse-gas-emissions-fy2025"
    },
    {
        "title": "Special Envoy&#039;s Message: World Water Day 2025",
        "summary": "",
        "date": "20 Mar 2025",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/special-envoys-message-world-water-day-2025-57927"
    },
    {
        "title": "Special Envoy Marsudi Discusses the Global Water Agenda in 2026 UN Water Conference Co-Host UAE",
        "summary": "",
        "date": "10 Jan 2025",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/special-envoy-marsudi-discusses-global-water-agenda-2026-un-water-conference-co-host-uae-57896"
    },
    {
        "title": "UN, OECD to closely align global work in water and sanitation",
        "summary": "",
        "date": "29 Nov 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/un-oecd-closely-align-global-work-water-and-sanitation-57895"
    },
    {
        "title": "Water is both a victim and a solution to climate change",
        "summary": "",
        "date": "13 Nov 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/water-both-victim-and-solution-climate-change-57894"
    },
    {
        "title": "Water for Climate: Together Better, Together Stronger",
        "summary": "",
        "date": "12 Nov 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/water-climate-together-better-together-stronger-57083"
    },
    {
        "title": "Water and Sanitation Success is Fundamental to Achieving All SDGs",
        "summary": "",
        "date": "5 Nov 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/water-and-sanitation-success-fundamental-achieving-all-sdgs-57893"
    },
    {
        "title": "Water is Key to Attain Sustainable Development, Prosperity and Peace",
        "summary": "",
        "date": "4 Nov 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/water-key-attain-sustainable-development-prosperity-and-peace-57084"
    },
    {
        "title": "2024 High-level Political Forum on Sustainable Development",
        "summary": "8 18 July 2024, UNHQ, New York The High level Political Forum on Sustainable Development HLPF will be held from...",
        "date": "12 Jul 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/2024-high-level-political-forum-sustainable-development-56083"
    },
    {
        "title": "SB60: June UN Climate Meetings",
        "summary": "The 60th Subsidiary Bodies SB 60 session of the UNFCCC, also known as the Bonn Climate Change Conference, was held...",
        "date": "3 Jun 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/sb60-june-un-climate-meetings-56084"
    },
    {
        "title": "Water Action Agenda: Invitation to submit progress report",
        "summary": "",
        "date": "24 Apr 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/water-action-agenda-invitation-submit-progress-report-55191"
    },
    {
        "title": "UN to Convene Global Experts in Tokyo on 4-6 March to Assess Climate Action Targets under Sustainable Development Goals",
        "summary": "",
        "date": "1 Mar 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/un-convene-global-experts-tokyo-4-6-march-assess-climate-action-targets-under-sustainable"
    },
    {
        "title": "UNEA Adopts a Bold Resolution on Promoting Synergies in Environmental Action",
        "summary": "26 February 1 March 2024, Nairobi, Kenya Leading the way in this rapidly expanding field, Japan put forward a resolution...",
        "date": "1 Mar 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/unea-adopts-bold-resolution-promoting-synergies-environmental-action-56082"
    },
    {
        "title": "United Nations Secretary-General Appoints New Members to the High-level Group to Champion Science, Technology, and Innovation for the Sustainable Development Goals",
        "summary": "",
        "date": "1 Feb 2024",
        "source": "UN SDGs",
        "link": "https://sdgs.un.org/news/united-nations-secretary-general-appoints-new-members-high-level-group-champion-science"
    }
]